STMicroelectronics/STM32CubeL5/Projects/STM32L562E-DK/Applications/TFM/TFM_SBSFU_Boot/Src/bl2_nv_services.c
/**
  ******************************************************************************
  * @file    bl2_nv_service.c
  * @author  MCD Application Team
  * @brief   This file provides all the Non volatile firmware functions.
  @verbatim
  ==============================================================================

                   ##### How to use this driver #####
  ==============================================================================
    [..]
      This driver provides functions to initialize Non Volatile Storage, to read and
      write Non volatile Monothonic Counters.

      (#) NVCNT initialization functions:
               (++) Initialize NVCNT using tfm_plat_init_nv_counter function,
         it must be performed at system start up.
         At first boot, on a virgin flash, the NV area is formatted and
         HUK seed (32bits) is randomly generated and written in NV area.

      (#) NVCNT counter access functions:
           (++) Write Monothonic counter using tfm_plat_set_nv_counter or tfm_plat_set_nv_counter functions
                A Clean Up request can be raised as return parameter in case
                FLASH pages used by EEPROM emulation, are full.
           (++) Read monothonic counter using tfm_plat_read_nv_counter functions

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "boot_hal_cfg.h"
#include "string.h"
#include "platform/include/tfm_plat_nv_counters.h"
#ifdef TFM_DEV_MODE
#define BOOT_LOG_LEVEL BOOT_LOG_LEVEL_INFO
#else
#define BOOT_LOG_LEVEL BOOT_LOG_LEVEL_OFF
#endif /* TFM_DEV_MODE */
#include "bootutil/bootutil_log.h"
#include "low_level_rng.h"
#include "tfm_boot_status.h"
#include "boot_record.h"
#include <limits.h>
#include "Driver_Flash.h"
#include "flash_layout.h"
#include "stm32l5xx_ll_crc.h"
#include "stm32l5xx_ll_bus.h"

/** @defgroup NVCNT Implementation NVCNT Implementation
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/** @defgroup NVCNT_Private_Structures NVCNT Private Structures
  * @{
  */


/**
  * @brief  NVCNT State Type structure definition.
  */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup NVCNT_Private_Variables NVCNT Private Variables
  * @{
  */
extern ARM_DRIVER_FLASH FLASH_DEV_NAME;
/*  HUK is 32 bytes , each element of 8 bytes contains 4 bytes of data */
#define HUK_SIZE 32U
#define NVCNT_ID_HUK ((NVCNT_ID_TYPE)0x4855)
#define PAGE_HEADER_SIZE  (2*HUK_SIZE)
#define NVCNT_HEADER_VALUE (uint32_t)(0xaaddeecc)
/* Global variables used to store eeprom status */
static uint32_t uhNbWrittenElements = 0U;                  /*!< Nb of elements written in valid and active pages */
static uint32_t uwAddressNextWrite = PAGE_HEADER_SIZE;     /*!< Initialize write position just after page header */

/**
  * @}
  */
/* Private configuration  -----------------------------------------------*/
/** @defgroup NVCNT_Private_configuration NVCNT Private configuration
  * @{
  */
/* Configuration of crc calculation for eeprom emulation in flash */
#define NVCNT_ID_TYPE  uint16_t                      /*!< Type of Virtual Address */
#define NVCNT_ID_SHIFT 0U                            /*!< Bits Shifting to get Virtual Address in element */
#define NVCNT_CRC_TYPE             uint16_t                      /*!< Type of Crc */
#define NVCNT_CRC_SHIFT            16U                           /*!< Bits Shifting to get Crc in element */
#define NVCNT_DATA_TYPE            uint32_t                      /*!< Type of Data */
#define NVCNT_DATA_SHIFT           32U                           /*!< Bits Shifting to get Data value in element */
#define NVCNT_MASK_ID              (uint64_t)0x000000000000FFFFU
#define NVCNT_MASK_CRC             (uint64_t)0x00000000FFFF0000U
#define NVCNT_MASK_DATA            (uint64_t)0xFFFFFFFF00000000U
#define NVCNT_MASK_FULL            (uint64_t)0xFFFFFFFFFFFFFFFFU
/*!< Get Crc value from element value */
#define NVCNT_CRC_VALUE(__ELEMENT__) (NVCNT_CRC_TYPE)(((__ELEMENT__) & NVCNT_MASK_CRC) >> NVCNT_CRC_SHIFT)
/*!< Get element value from id, data and crc values */
#define NVCNT_ELEMENT_VALUE(__ID__,__DATA__,__CRC__) (((NVCNT_ELEMENT_TYPE)(__DATA__) << NVCNT_DATA_SHIFT)\
                                                      | (__CRC__) << NVCNT_CRC_SHIFT | (__ID__))
#define CRC_POLYNOMIAL_LENGTH   LL_CRC_POLYLENGTH_16B /* CRC polynomial length 16 bits */
#define CRC_POLYNOMIAL_VALUE    0x8005U /* Polynomial to use for CRC calculation */
#define NVCNT_ELEMENT_TYPE uint64_t
#define NVCNT_ELEMENT_SIZE sizeof(NVCNT_ELEMENT_TYPE)
/*!< Flash value after erase */
#define NVCNT_PAGESTAT_ERASED (uint64_t)0xFFFFFFFFFFFFFFFFU /*!< Flash value after erase */
#define NVCNT_MAX_WRITTEN_ELEMENTS ((BL2_NV_COUNTERS_AREA_SIZE - PAGE_HEADER_SIZE) / NVCNT_ELEMENT_SIZE)
/*!< Get id value from element value */
#define NVCNT_ID_VALUE(__ELEMENT__) (NVCNT_ID_TYPE)((__ELEMENT__) & NVCNT_MASK_ID)
/*!< Get Data value from element value*/
#define NVCNT_DATA_VALUE(__ELEMENT__) (NVCNT_DATA_TYPE)(((__ELEMENT__)\
                                                         & NVCNT_MASK_DATA) >> NVCNT_DATA_SHIFT)

#define NVCNT_INIT_VALUE 0U
/* Private function prototypes -----------------------------------------------*/
/** @defgroup NCNT_Private_Functions EEPROM Private Functions
  * @{
  */

static bool VerifyPageFullyErased(uint32_t Address, uint32_t PageSize);
static void ConfigureCrc(void);
static uint16_t CalculateCrc(NVCNT_DATA_TYPE Data, uint16_t CounterIc);
static bool Check_Header(void);
static bool Write_Header(void);
static bool init_counter(void);
/**
  * @}
  */
/* Exported functions -------------------------------------------------------*/
/** @addtogroup EEPROM_Exported_Functions
  * @{
  */

/**
  * @brief  Initialize nv counter storage block if not formatted.
  *         Check consistency of nv counter storage
  *         Initialize global variable for write access.
  *
  * @retval enum tfm_plat_err_t
  *           - TFM_PLAT_ERR_SUCCESS in case of success
  *           - TFM_PLAT_ERR_SYSTEM_ERR in case of error
  */
enum tfm_plat_err_t tfm_plat_init_nv_counter(void)
{

  int32_t  err;
  uint32_t  varidx = 0U;
  NVCNT_ELEMENT_TYPE addressvalue = 0U;
  NVCNT_DATA_TYPE counter_value;

  /*********************************************************************/
  /* Step 0: test if it is a full erased page                          */
  /*********************************************************************/
  if (VerifyPageFullyErased(BL2_NV_COUNTERS_AREA_ADDR, BL2_NV_COUNTERS_AREA_SIZE))
  {
    /* page is fully erase */
    /* no power down/reset is expected during this 1st initialization  */
    /* a regression is required to be able to restart the initialization */
    /* incomplete initialization is detected in step 1, and bl2 will */
    /* not launch installed image*/

    /* Delay to avoid voltage rebound effect (power down) at start up
       during BL2 NV area initialization period */
    HAL_Delay(500);

    BOOT_LOG_INF("Initializing BL2 NV area : Power down/reset not supported...");
    if (!Write_Header())
    {
      BOOT_LOG_ERR("Init BL2 NV Header area: Failed");
      return TFM_PLAT_ERR_SYSTEM_ERR;
    }
    BOOT_LOG_INF("Init BL2 NV Header area: Done");
    /* initialize nv counter 3 to 0 */
    BOOT_LOG_INF("Initializing BL2 NV Counters");

    if (!init_counter())
    {
      BOOT_LOG_ERR("Init BL2 NV counters : Failed");
      return TFM_PLAT_ERR_SYSTEM_ERR;
    }
    BOOT_LOG_INF("Init BL2 NV counters to 0 : Done");
    BOOT_LOG_INF("BL2 NV Area Initialized : Power Down/reset supported");
  }
  /*********************************************************************/
  /* Step 1: verify header presence                                    */
  /*                                                                   */
  /*********************************************************************/
  BOOT_LOG_INF("Checking BL2 NV area");
  BOOT_LOG_INF("Checking BL2 NV area header");
  if (!Check_Header())
  {
    BOOT_LOG_ERR("Wrong BL2 NV Area header");
    return TFM_PLAT_ERR_SYSTEM_ERR;
  }
  BOOT_LOG_INF("Checking BL2 NV Counter consistency");
  if (tfm_plat_read_nv_counter(PLAT_NV_COUNTER_3, sizeof(counter_value),
                               (uint8_t *)&counter_value) != TFM_PLAT_ERR_SUCCESS)
  {
    BOOT_LOG_ERR("NV Counter Not consistent %d", PLAT_NV_COUNTER_3);
    return TFM_PLAT_ERR_SYSTEM_ERR;
  }
  BOOT_LOG_INF("Consistent BL2 NV Counter %d  = 0x%x", PLAT_NV_COUNTER_3, counter_value);
  if (tfm_plat_read_nv_counter(PLAT_NV_COUNTER_4, sizeof(counter_value),
                               (uint8_t *)&counter_value) != TFM_PLAT_ERR_SUCCESS)
  {
    BOOT_LOG_ERR("NV Counter Not consistent %d", PLAT_NV_COUNTER_4);
    return TFM_PLAT_ERR_SYSTEM_ERR;
  }
  BOOT_LOG_INF("Consistent BL2 NV Counter %d  = 0x%x", PLAT_NV_COUNTER_4, counter_value);

  /*********************************************************************/
  /* Step 2: Initialize eeprom emulation global variables relative     */
  /*                                                                   */
  /*********************************************************************/
  /* Initialize global variables, with elements detected in active page */
  uhNbWrittenElements = 0U;
  uwAddressNextWrite = PAGE_HEADER_SIZE;

  for (varidx = PAGE_HEADER_SIZE; varidx < BL2_NV_COUNTERS_AREA_SIZE; varidx += NVCNT_ELEMENT_SIZE)
  {
    /* Check elements present in active page */
    err = FLASH_DEV_NAME.ReadData(BL2_NV_COUNTERS_AREA_ADDR + varidx, &addressvalue,
                                  sizeof(addressvalue));
    if ((err == ARM_DRIVER_ERROR_SPECIFIC) || (addressvalue != NVCNT_MASK_FULL))
    {
      /* Then increment uhNbWrittenElements and uwAddressNextWrite */
      uhNbWrittenElements++;
      uwAddressNextWrite += NVCNT_ELEMENT_SIZE;
    }
    else /* no more element in the page */
    {
      if (err != ARM_DRIVER_OK)
      {
        return TFM_PLAT_ERR_SYSTEM_ERR;
      }
      break;
    }
  }

  /*********************************************************************/
  /* Step 2 : Check consistency of PLAT_NV_COUNTER_3 counter history   */
  /*********************************************************************/
  return TFM_PLAT_ERR_SUCCESS;
}

/**
  * @brief  Writes/updates counter data in NV area.
  * @warning This function is not reentrant
  * @param  CounterId to be written
  * @param  Data 32bits data to be written
  * @retval enum tfm_plat_err_t
  *           TFM_PLAT_ERR_SUCCESS on write successfully done.
              TFM_PLAT_ERR_MAX_VALUE when max updateable value written
  */
enum tfm_plat_err_t tfm_plat_set_nv_counter(enum tfm_nv_counter_t CounterId,
                                            uint32_t Data)
{
  int32_t err;
  uint32_t crc = 0U;
  NVCNT_ELEMENT_TYPE element;
  NVCNT_DATA_TYPE current_value;
  /* check current value is not already in flash, and is consistent */
  if ((tfm_plat_read_nv_counter(CounterId, sizeof(current_value), (uint8_t *)&current_value)
       != TFM_PLAT_ERR_SUCCESS) || (Data < current_value))
  {
    return TFM_PLAT_ERR_SYSTEM_ERR;
  }
  /* check if same value is requested */
  if (current_value == Data)
  {
    /* nothing to do */
    return TFM_PLAT_ERR_SUCCESS;
  }

  /* Check if pages are full, i.e. max number of written elements achieved */
  if (uhNbWrittenElements >= NVCNT_MAX_WRITTEN_ELEMENTS)
  {
    return TFM_PLAT_ERR_MAX_VALUE;
  }

  /* Calculate crc of variable data and virtual address */
  crc = CalculateCrc(Data, CounterId);
  /*  build element  */
  element = NVCNT_ELEMENT_VALUE(CounterId, Data, crc);
  /* Program variable data + virtual address + crc */
  err = FLASH_DEV_NAME.ProgramData(BL2_NV_COUNTERS_AREA_ADDR + uwAddressNextWrite,
                                   &element,
                                   NVCNT_ELEMENT_SIZE);
  /* If program operation was failed, a Flash error code is returned */
  if (err != ARM_DRIVER_OK)
  {
    return TFM_PLAT_ERR_SYSTEM_ERR;
  }

  /* Increment global variables relative to write operation done*/
  uwAddressNextWrite += NVCNT_ELEMENT_SIZE;
  uhNbWrittenElements++;
  BOOT_LOG_INF("Counter %d set to 0x%x", CounterId, Data);
  return TFM_PLAT_ERR_SUCCESS;
}

/**
  * @brief  Increment/updates counter data in NV area.
  * @warning This function is not reentrant
  * @param  CounterId to be written
   * @retval enum tfm_plat_err_t
  *           TFM_PLAT_ERR_SUCCESS on write successfully done.
              TFM_PLAT_ERR_MAX_VALUE when max updateable value written
  */

enum tfm_plat_err_t tfm_plat_increment_nv_counter(
  enum tfm_nv_counter_t counter_id)
{
  uint32_t security_cnt;
  enum tfm_plat_err_t err;

  err = tfm_plat_read_nv_counter(counter_id,
                                 sizeof(security_cnt),
                                 (uint8_t *)&security_cnt);
  if (err != TFM_PLAT_ERR_SUCCESS)
  {
    return err;
  }

